<a href="https://colab.research.google.com/github/syaefulalam/office/blob/master/Profile%20test.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [6]:
!git clone https://github.com/syaefulalam/office

Cloning into 'office'...
remote: Enumerating objects: 15, done.
remote: Counting objects: 100% (15/15), done.
remote: Compressing objects: 100% (15/15), done.
remote: Total 15 (delta 6), reused 0 (delta 0), pack-reused 0
Unpacking objects: 100% (15/15), done.

In [0]:
data = pd.read_csv('office/profile test.csv', sep=',')

In [8]:
data.info ()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 306 entries, 0 to 305
Data columns (total 9 columns):
msisdn        306 non-null int64
unit_type     305 non-null object
unit_name     305 non-null object
brand         306 non-null object
age           306 non-null int64
Unnamed: 5    0 non-null float64
Unnamed: 6    0 non-null float64
Unnamed: 7    8 non-null object
Unnamed: 8    9 non-null object
dtypes: float64(2), int64(2), object(5)
memory usage: 21.6+ KB

In [6]:
data.head ()

         msisdn   unit_type  ...   Unnamed: 7       Unnamed: 8
0  628111000887  callcenter  ...   Row Labels  Count of msisdn
1  628111000908  callcenter  ...   callcenter               83
2  628111000908  callcenter  ...        gerai               87
3  628111000908     grapari  ...      grapari               44
4  628111000908  callcenter  ...  headquarter                4

[5 rows x 9 columns]

In [0]:
#remove duplicate
data = data.drop_duplicates(subset=['msisdn'])

In [0]:
#delete satu coloumn
data2 = data.drop(columns="Unnamed: 5")

In [26]:
data2.head ()

          msisdn   unit_type  ...  Unnamed: 7       Unnamed: 8
0   628111000887  callcenter  ...  Row Labels  Count of msisdn
1   628111000908  callcenter  ...  callcenter               83
5   628111001013       gerai  ...         NaN                1
11  628111001097     grapari  ...         NaN              NaN
12  628111001307  callcenter  ...         NaN              NaN

[5 rows x 8 columns]

In [0]:
#delete multiple coloumn
data3 = data2.drop(["Unnamed: 6", "Unnamed: 7", "Unnamed: 8"], axis=1)

In [14]:
data3.head ()

          msisdn   unit_type         unit_name      brand  age
0   628111000887  callcenter        CC BANDUNG  kartuHALO   46
1   628111000908  callcenter        CC BANDUNG  kartuHALO   54
5   628111001013       gerai  KOTA KASABLANKA   kartuHALO   46
11  628111001097     grapari           CILEGON  kartuHALO   21
12  628111001307  callcenter       CC SURABAYA  kartuHALO   35

In [0]:
#delete multiple coloumn
data4 = data3.drop(["unit_name", "brand"], axis=1)

In [30]:
data4.head ()

     unit_type  age
0   callcenter   46
1   callcenter   54
5        gerai   46
11     grapari   21
12  callcenter   35

In [16]:
df.pivot( columns='unit_type', values='age')

NameError: ignored

In [35]:
data5.head()

unit_type  callcenter  callcenter  gerai  ...  webservice  webservice  webservice
age                46          54     46  ...          35          19          53

[1 rows x 106 columns]